String getSurahName(int surah) {
    const names = {
      1: 'ٱلْفَاتِحَة', 2: 'ٱلْبَقَرَة', 3: 'آلِ عِمْرَٰن', 4: 'ٱلنِّسَاء', 5: 'ٱلْمَائِدَة',
      6: 'ٱلْأَنْعَام', 7: 'ٱلْأَعْرَاف', 8: 'ٱلْأَنْفَال', 9: 'ٱلتَّوْبَة', 10: 'يُونُس',
      11: 'هُود', 12: 'يُوسُف', 13: 'ٱلرَّعْد', 14: 'إِبْرَاهِيم', 15: 'ٱلْحِجْر',
      16: 'ٱلنَّحْل', 17: 'ٱلْإِسْرَاء', 18: 'ٱلْكَهْف', 19: 'مَرْيَم', 20: 'طه',
      21: 'ٱلْأَنْبِيَاء', 22: 'ٱلْحَجّ', 23: 'ٱلْمُؤْمِنُون', 24: 'ٱلنُّور', 25: 'ٱلْفُرْقَان',
      26: 'ٱلشُّعَرَاء', 27: 'ٱلنَّمْل', 28: 'ٱلْقَصَص', 29: 'ٱلْعَنْكَبُوت', 30: 'ٱلرُّوم',
      31: 'لُقْمَان', 32: 'ٱلسَّجْدَة', 33: 'ٱلْأَحْزَاب', 34: 'سَبَأ', 35: 'فَاطِر',
      36: 'يس', 37: 'ٱلصَّافَّات', 38: 'ص', 39: 'ٱلزُّمَر', 40: 'غَافِر',
      41: 'فُصِّلَت', 42: 'ٱلشُّورَى', 43: 'ٱلزُّخْرُف', 44: 'ٱلدُّخَان', 45: 'ٱلْجَاثِيَة',
      46: 'ٱلْأَحْقَاف', 47: 'مُحَمَّد', 48: 'ٱلْفَتْح', 49: 'ٱلْحُجُرَات', 50: 'ق',
      51: 'ٱلذَّارِيَات', 52: 'ٱلطُّور', 53: 'ٱلنَّجْم', 54: 'ٱلْقَمَر', 55: 'ٱلرَّحْمَٰن',
      56: 'ٱلْوَاقِعَة', 57: 'ٱلْحَدِيد', 58: 'ٱلْمُجَادِلَة', 59: 'ٱلْحَشْر', 60: 'ٱلْمُمْتَحَنَة',
      61: 'ٱلصَّفّ', 62: 'ٱلْجُمُعَة', 63: 'ٱلْمُنَافِقُون', 64: 'ٱلتَّغَابُن', 65: 'ٱلطَّلَاق',
      66: 'ٱلتَّحْرِيم', 67: 'ٱلْمُلْك', 68: 'ٱلْقَلَم', 69: 'ٱلْحَاقَّة', 70: 'ٱلْمَعَارِج',
      71: 'نُوح', 72: 'ٱلْجِنّ', 73: 'ٱلْمُزَّمِّل', 74: 'ٱلْمُدَّثِّر', 75: 'ٱلْقِيَامَة',
      76: 'ٱلْإِنسَان', 77: 'ٱلْمُرْسَلَات', 78: 'ٱلنَّبَأ', 79: 'ٱلنَّازِعَات', 80: 'عَبَسَ',
      81: 'ٱلتَّكْوِير', 82: 'ٱلْإِنفِطَار', 83: 'ٱلْمُطَفِّفِينَ', 84: 'ٱلْإِنشِقَاق', 85: 'ٱلْبُرُوج',
      86: 'ٱلطَّارِق', 87: 'ٱلْأَعْلَى', 88: 'ٱلْغَاشِيَة', 89: 'ٱلْفَجْر', 90: 'ٱلْبَلَد',
      91: 'ٱلشَّمْس', 92: 'ٱلْلَّيْل', 93: 'ٱلضُّحَى', 94: 'ٱلشَّرْح', 95: 'ٱلتِّين',
      96: 'ٱلْعَلَق', 97: 'ٱلْقَدْر', 98: 'ٱلْبَيِّنَة', 99: 'ٱلزَّلْزَلَة', 100: 'ٱلْعَادِيَات',
      101: 'ٱلْقَارِعَة', 102: 'ٱلتَّكَاثُر', 103: 'ٱلْعَصْر', 104: 'ٱلْهُمَزَة', 105: 'ٱلْفِيل',
      106: 'قُرَيْش', 107: 'ٱلْمَاعُون', 108: 'ٱلْكَوْثَر', 109: 'ٱلْكَافِرُون', 110: 'ٱلنَّصْر',
      111: 'ٱلْمَسَد', 112: 'ٱلْإِخْلَاص', 113: 'ٱلْفَلَق', 114: 'ٱلنَّاس',
    };
  return 'سورة ' + (names[surah] ?? 'سورة $surah');
}